{
  "block.mekanismgenerators.bioethanol": "Bio-Ethanol",
  "description.mekanismgenerators.advanced_solar_generator": "An advanced generator that directly absorbs the sun's rays to produce energy with little loss.",
  "description.mekanismgenerators.bio_generator": "A generator that burns organic materials from the world to produce energy.",
  "description.mekanismgenerators.electromagnetic_coil": "A block that converts kinetic energy from a Rotational Complex into usable electricity. Any coil touching either the Rotational Complex itself, or another valid coil, will contribute to the energy produced.",
  "description.mekanismgenerators.fission_reactor_logic_adapter": "A block that can be used to monitor or control the Fission Reactor with Redstone.",
  "description.mekanismgenerators.gas_burning_generator": "A generator that burns varous gases to produce energy.",
  "description.mekanismgenerators.geothermal_generator_unit": "Produces energy from geothermal sources in the environment, and improves protection against damage from heat sources. Install multiple for faster charging and greater protection.",
  "description.mekanismgenerators.laser_focus_matrix": "A panel of Reactor Glass that is capable of absorbing optical energy and thereby heating up the Fusion Reactor.",
  "description.mekanismgenerators.reactor.logic.capacity": "The reactor's core heat capacity has been met",
  "description.mekanismgenerators.reactor.logic.depleted": "The reactor has insufficient fuel to sustain a reaction",
  "description.mekanismgenerators.reactor.logic.disabled": "Will not emit a Redstone signal",
  "description.mekanismgenerators.reactor_glass": "Reinforced glass that can be used in the Fusion Reactor multiblock.",
  "description.mekanismgenerators.turbine_rotor": "The steel rod that is used to hold Turbine Blades within an Industrial Turbine.",
  "description.mekanismgenerators.wind_generator": "A generator that uses the strength of the wind to produce energy, with greater efficiency at higher altitudes.",
  "fission.mekanismgenerators.invalid_missing_fuel_assembly": "Could not form, no fuel assembly structures present.",
  "item.mekanismgenerators.bioethanol_bucket": "Bio-Ethanol Bucket",
  "sound_event.mekanismgenerators.tile.generator.wind": "Wind generator whooshes",
  "turbine.mekanismgenerators.invalid_bad_rotors": "Could not form, invalid Turbine Rotor arrangement.",
  "turbine.mekanismgenerators.invalid_even_length": "Could not form, width and length of structure must be odd.",
  "turbine.mekanismgenerators.invalid_malformed_coils": "Could not form, Electromagnetic Coil arrangement is malformed. Coils must be connected to Rotational Complex and adjacently connected.",
  "turbine.mekanismgenerators.invalid_malformed_dispersers": "Could not form, Pressure Disperser arrangement is malformed. Dispersers must create complete horizontal layer surrounding Rotational Complex.",
  "turbine.mekanismgenerators.invalid_missing_complex": "Could not form, no Rotational Complex present.",
  "turbine.mekanismgenerators.invalid_rotors_not_contiguous": "Could not form, rotors are invalid (non-contiguous).",
  "turbine.mekanismgenerators.invalid_too_narrow": "Could not form, structure is too narrow to support turbine size.",
  "turbine.mekanismgenerators.invalid_vent_below_complex": "Could not form, found a Turbine Vent below Pressure Disperser layer. Vents must be at or above vertical position of disperser layer."
}